什么是CSS?
	CSS: 层叠样式表，用来修饰(美化)HTML 网页的一门技术。使用CSS 属性来设置样式，可以将设置样式的CSS 代码和展示数据的HTML 代码进行分离。并且还可以实现代码的复用，增强网页的展示能力。
		<table border="1" bgcolor="red" align="center"></table>

如果在HTML 中引入CSS
	1.2.1 通过标签上的style 属性引入CSS 样式
		<!--
			1. 
		-->
	
	1.2.2 通过head 标签内部的style 标签引入CSS 样式
	
	1.2.3 通过链接引入外部的CSS 文件来引入CSS 样式




选择器
	所谓的选择器就是在HTML 中帮助我们选择标签进行修饰的技术
	
	1.1 基本选择器
		1.1.1 标签名(元素名)选择器
			根据元素的名称来选择指定名称的元素进行修饰。
			
		1.1.2 class 选择器
		1.1.3 ID 选择器
		
	1.2 扩展选择器
		在基本选择器选择的基础上进行更加复杂的选择器
		1.2.1 后代选择器
		1.2.2 子元素选择器
		1.2.3 分组选择器
		1.2.4 属性选择器
		1.2.5 相邻兄弟选择器
		1.2.6 伪元素选择器



盒子模型


常用的属性





















